{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "Hey, is anyone there?",
        "Good day",
        "Hello, how can I get help?",
        "Hey, what's up?",
        "Greetings",
        "Hey",
        "Howdy",
        "Namaste",
        "Yo"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! How can I help you?",
        "Hello, how are you doing?",
        "Hi! How can I be of service?",
        "Hello! How can I assist you today?",
        "Hi there! How can I help you?",
        "Hello! How can I assist you today?",
        "Hi there! How can I help you?",
        "Namaste! How can I assist you today?",
        "Hey! How can I help you?"
      ]
    },
    {
      "tag": "farewell",
      "patterns": [
        "Goodbye",
        "See you later",
        "Take care",
        "Bye",
        "Thanks for your help",
        "I'm done for now",
        "Signing off",
        "Adios",
        "Until next time",
        "Catch you later"
      ],
      "responses": [
        "Goodbye! Take care and have a great day!",
        "See you later! If you need any further assistance, feel free to ask.",
        "Take care and have a wonderful day!",
        "Bye! Don't hesitate to reach out if you need any more help.",
        "You're welcome! If you have any more questions, feel free to ask.",
        "Alright, take care! Feel free to come back if you need assistance.",
        "Signing off for now. Have a great day ahead!",
        "Adios! If you need any further support, feel free to ask.",
        "Until next time! Take care and stay positive.",
        "Catch you later! If you need any more help, don't hesitate to reach out."
      ]
    },
      {
        "tag": "information_jee_mains",
        "patterns": [
          "What is JEE Mains?",
          "Tell me about JEE Mains",
          "What are the eligibility criteria for JEE Mains?",
          "How many times is JEE Mains conducted in a year?",
          "What is the exam pattern of JEE Mains?",
          "What is the syllabus for JEE Mains?"
        ],
        "responses": [
          "JEE Mains is a national level entrance exam conducted for admission into undergraduate engineering programs in India.",
          "JEE Mains is an engineering entrance exam administered by the National Testing Agency (NTA). It serves as a qualifying exam for JEE Advanced and as a gateway for various engineering colleges.",
          "The eligibility criteria for JEE Mains include qualifying examination, age limit, and subject requirements. It is best to refer to the official JEE Mains website for detailed eligibility information.",
          "JEE Mains is conducted twice a year, usually in January and April. This allows candidates to improve their scores and get a chance to appear in multiple attempts.",
          "The exam pattern of JEE Mains consists of multiple-choice questions (MCQs) with four options. It covers subjects like Physics, Chemistry, and Mathematics.",
          "The syllabus for JEE Mains is based on the NCERT curriculum and covers topics from Physics, Chemistry, and Mathematics. It is recommended to refer to the official JEE Mains website for a detailed syllabus."
        ]
      },
      {
        "tag": "information_jee_advanced",
        "patterns": [
          "What is JEE Advanced?",
          "Tell me about JEE Advanced",
          "What is the eligibility criteria for JEE Advanced?",
          "How many times is JEE Advanced conducted in a year?",
          "What is the exam pattern of JEE Advanced?",
          "What is the syllabus for JEE Advanced?"
        ],
        "responses": [
          "JEE Advanced is the second stage of the Joint Entrance Examination conducted for admission into the Indian Institutes of Technology (IITs).",
          "JEE Advanced is an engineering entrance exam administered by one of the IITs on a rotational basis. It is considered one of the most prestigious engineering exams in India.",
          "To be eligible for JEE Advanced, a candidate must qualify JEE Mains and be within the top rankers. Additional eligibility criteria can be found on the official JEE Advanced website.",
          "JEE Advanced is conducted once a year, usually in the month of May. Only candidates who meet the eligibility criteria and qualify JEE Mains are eligible to appear for JEE Advanced.",
          "The exam pattern of JEE Advanced consists of multiple-choice questions, numerical answer type questions, and match the following questions. It covers subjects like Physics, Chemistry, and Mathematics.",
          "The syllabus for JEE Advanced is more extensive compared to JEE Mains. It covers advanced topics in Physics, Chemistry, and Mathematics. It is recommended to refer to the official JEE Advanced website for the detailed syllabus."
        ]
      },
      {
        "tag": "resources_preparation",
        "patterns": [
          "What are some recommended books for JEE preparation?",
          "Can you suggest online resources for JEE preparation?",
          "Where can I find JEE study materials?",
          "Are there any coaching institutes for JEE preparation?",
          "Can you recommend mock test series for JEE?"
        ],
        "responses": [
          "There are several recommended books for JEE preparation, such as 'Concepts of Physics' by H.C. Verma, 'Organic Chemistry' by Morrison and Boyd, and 'Mathematics' by R.D. Sharma.",
          "There are numerous online platforms that provide resources for JEE preparation, such as Khan Academy, Unacademy, and Byju's. These platforms offer video lectures, practice questions, and study materials.",
          "You can find JEE study materials on various websites and educational platforms. Additionally, you can refer to previous years' question papers and solutions available on the official JEE website.",
          "Yes, there are several coaching institutes that offer specialized JEE preparation programs. Some popular coaching institutes in India include FIITJEE, Allen Career Institute, and Resonance.",
          "There are many mock test series available for JEE preparation. Some recommended ones include the mock tests provided by NTA on the official JEE website, as well as those offered by coaching institutes and online learning platforms."
        ]
      },
      {
        "tag": "information_jee_institutes",
        "patterns": [
          "Which institutes accept JEE scores?",
          "Can you recommend some institutes under JEE?",
          "What are the top IITs in India?",
          "Tell me about NITs",
          "Are there any IIITs under JEE?"
        ],
        "responses": [
          "JEE scores are accepted by the Indian Institutes of Technology (IITs), National Institutes of Technology (NITs), Indian Institutes of Information Technology (IIITs), and other premier engineering colleges in India.",
          "Some renowned institutes under JEE include the Indian Institutes of Technology (IITs), National Institutes of Technology (NITs), Indian Institutes of Information Technology (IIITs), and other centrally funded technical institutions.",
          "The top IITs in India include IIT Bombay, IIT Delhi, IIT Madras, IIT Kanpur, IIT Kharagpur, and IIT Roorkee. These institutes are known for their excellence in engineering education.",
          "National Institutes of Technology (NITs) are prestigious engineering institutions in India. They offer undergraduate, postgraduate, and doctoral programs in various engineering disciplines. Some well-known NITs include NIT Trichy, NIT Warangal, and NIT Surathkal.",
          "Yes, there are Indian Institutes of Information Technology (IIITs) that accept JEE scores. These institutes specialize in information technology-related courses. Some notable IIITs include IIIT Hyderabad, IIIT Delhi, and IIIT Allahabad."
        ]
      }
    ]
}